[ { "id"      : 0,
    "name"    : "Fast Track Machine",
    "summary" : "Asp.net, node.js, WebRTC, WSO2",
    "details" : "Touch screen which interact with customers, show him his account activity and can talk to customer service with video call" },
  { "id"      : 1,
    "name"    : "SAIB Egypt internet banking",
    "summary" : "ASP.Net, SQL Server, ADO.Net, JQuery, BootStrap, Microsoft Dynamics CRM 2011,2015",
    "details" : "Building a multi-channel comprehensive internet banking solution for SAIB bank. The solution provides Online Retail Banking, Online SME Banking, Online Corporate Banking, Mobile Banking, Call Center Banking, Kiosk/Self Service Terminals, SMS Banking, and Branch Front End. It integrates with multiple third party systems ( T24 Core banking , VASCO security tokens , SMS gateways)" },
  { "id"      : 2,
    "name"    : "IMNS (Integrated Mass Notification System)",
    "summary" : "ASP.NET MVC, EF, AngularJS, WebAPI",
    "details" : "A web portal which integrates Mass Notification Systems." },
  { "id"      : 3,
    "name"    : "CRA (Commercial Registration Authority)",
    "summary" : "Asp.net, SQL Server , js",
    "details" : "- Web portal for companies legal names reservation and registration - Web application for administrating the portal that included full system logging and history tracking for every entity within the portal - E-Services section for to manage governmental procedure of booking a new trade name and other related services" },
  { "id"      : 4,
    "name"    : "Network Alerting Solution",
    "summary" : "C#, WCF, ADO.NET, Sql server , Crystal reports",
    "details" : "Network Alerting Service: WCF Service used to notify hundreds clients who use Network Alerting Player in time of emergency." },
  { "id"      : 5,
    "name"    : "Subscription & Billing System (SBS)",
    "summary" : "C#, WCF, ADO.NET, Sql server , Crystal reports",
    "details" : "Complete Billing & Logistics solutions for the Billing System for the Dealers to Sell or renew packages Online, vendors to upload shipments for dealers, Finance for all Financial Management, Store for maintaining the complete store information and Customer to view his own info and admin to have a complete view of the process." },
  { "id"      : 6,
    "name"    : "SBS Analytics Mobile App",
    "summary" : "Phone Gap (Cordova, Ionic)",
    "details" : "Project for displaying analytics value from WebAPI" },
  { "id"      : 7,
    "name"    : "Iuvo Me",
    "summary" : "ASP.NET MVC, EF, AngularJS, WebAPI",
    "details" : "Web portal as social media between Doctors and patients, presents reservations and other functionalities." },
  { "id"      : 8,
    "name"    : "Edzoona",
    "summary" : "ASP.NET MVC, EF, AngularJS, WebAPI",
    "details" : "Web portal as education system, Teachers present lessons for students." } 
  ]